<a href="https://colab.research.google.com/github/sheldoncooper07/Python-Modules/blob/master/pandas_concat.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
a={"City":["delhi","jaipur","pune"],
   "temp":[23,45,12],
    "windspeed":[12,23,1]}

In [30]:

df=pd.DataFrame(a,index=[0,1,2])
df

     City  temp  windspeed
0   delhi    23         12
1  jaipur    45         23
2    pune    12          1

In [0]:
b={"City":["jaipur","delhi","pune"],
   "temp":[45,2,3],
   "windspeed":[34,56,23]}

In [32]:
df1=pd.DataFrame(b,index=[1,0,2])
df1

     City  temp  windspeed
1  jaipur    45         34
0   delhi     2         56
2    pune     3         23

In [33]:
c=pd.concat([df,df1],axis=0, ignore_index=True)
c

     City  temp  windspeed
0   delhi    23         12
1  jaipur    45         23
2    pune    12          1
3  jaipur    45         34
4   delhi     2         56
5    pune     3         23

In [0]:
c=pd.concat([df,df1],axis=1)

In [35]:
c

     City  temp  windspeed    City  temp  windspeed
0   delhi    23         12   delhi     2         56
1  jaipur    45         23  jaipur    45         34
2    pune    12          1    pune     3         23

In [0]:
d=pd.Series(["normal","hot","cool"],name="weather")

In [37]:
e=pd.concat([df1,df],axis=1)
e

     City  temp  windspeed    City  temp  windspeed
0   delhi     2         56   delhi    23         12
1  jaipur    45         34  jaipur    45         23
2    pune     3         23    pune    12          1